IDEA StatiCa Open Model
BoltParam.BoltInteraction Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Indicates type of shear transfer
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public BoltShearType BoltInteraction { get; set; }
Public Property BoltInteraction As BoltShearType
	Get
	Set
public:
property BoltShearType BoltInteraction {
	BoltShearType get ();
	void set (BoltShearType value);
}
Property Value
Type: BoltShearType
See Also
Reference
BoltParam Class
IdeaRS.OpenModel.Parameters Namespace